[
  "3 SQL statements walk into a NoSQL bar. Soon, they walk out. They couldn't find a table.",
  "A SQL query walks into a bar, walks up to two tables and asks...",
  "A male developer often gets called as a Dev, then what would you call a female developer? Devi.",
  "An IPv6 packet is walking out of the house. He goes nowhere.",
  "How do you check if a webpage is HTML5? Try it out on Internet Explorer.",
  "How do you comfort a JavaScript bug? You console it!",
  "I was gonna tell you a joke about UDP... but you might not get it.",
  "To understand recursion, you must first understand recursion.",
  "What did the Java code say to the C code? You've got no class.",
  "What did the router say to the doctor? It hurts when IP.",
  "What do you call a programmer from Finland? Nerdic.",
  "What does 'Emojify' mean in programming? The process of making code more 😄.",
  "What's a developer's favorite mode of transportation? Git push bike.",
  "What's a programmer's favorite hangout place? Foo Bar!",
  "What's a programmer's favorite place to hang out on the internet? Foo Bar dot com.",
  "What's a programmer's favorite season? A merge conflict.",
  "What's a programmer's favorite type of coffee? Java.",
  "What's a programmer's favorite way to travel? A while loop.",
  "What's the most used language in programming? Profanity.",
  "Why do C# and Java developers keep breaking their keyboards? Because they use a strongly typed language.",
  "Why do Java developers wear glasses? Because they can't C#.",
  "Why do programmers prefer dark chocolate? It's a byte healthier.",
  "Why do programmers prefer dark mode? Because light attracts bugs.",
  "Why do programmers prefer iOS development? Because they don't like to Kotlin.",
  "Why do programmers prefer to work at night? Because the sun can't throw exceptions.",
  "Why did the developer get stuck in the shower? The shampoo bottle said, 'Lather, Rinse, Repeat,' but he just kept debugging.",
  "Why did the developer go broke? Because he lost his cache.",
  "Why did the programmer always mix up Christmas and Halloween? Because Oct 31 == Dec 25!",
  "Why did the programmer get thrown out of school? He was caught trying to use improper classes.",
  "Why did the programmer go broke? He lost his domain name in a bet.",
  "Why did the programmer quit his job? Because he didn't get arrays."
]
